module Main where
    -- Лабораторна робота №1
    -- Студента групи КН-31 підгрупа 2
    -- Сопов Сергій 
    -- Варіант №7

    -- Мета: Ознайомитись з основами синтаксису мови hask11ll, 
    -- набути пратктичних навичок у роботі з типами даних та функціями



-- Функція, що робить перехыд выд типу до типу.

function1 :: Integer -> Integer
function1 x = x^2

-- Функцiя визначає, чи одне коло повнiстю мiститься в iншому. Кожне коло задається координатами центра та радiусом.

function2 :: (Integer, Integer, Double, Integer, Integer, Double) -> Bool 
function2 (x1, y1, r1, x2, y2, r2) = sqrt ((x2-x1)^2 + (y2-y1)^2) <= abs(r1-r2)

function3 :: Integer -> Integer -> Double-> Integer -> Integer -> Double -> Bool 
function3 x1 y1 r1 x2 y2 r2 = sqrt ((x2-x1)^2 + (y2-y1)^2) <= abs(r1-r2)


-- Висновок:
    -- В результаті виконання лабораторної роботи було створено функції, що працюють із типами данних. 
    -- Це дозволило закріпити знання та набути практичних навичок роботи в haskell.